Autodesk.Revit.DB.NumericRevisionSettings.IsValid
Determines whether the NumericRevisionSettings object is in a valid state.
Remarks:
The NumericRevisionSettings should at least contain a non-negative start number.
Returns:
True if the NumericRevisionSettings is valid.
Since:
2016

Autodesk.Revit.DB.NumericRevisionSettings.IsEqual(Autodesk.Revit.DB.NumericRevisionSettings)
Determines whether a specified NumericRevisionSettings is the same as 'this'.
Remarks:
The two NumericRevisionSettings are regarded as the same only if they have the same start number,
prefix and suffix strings.
other:
The specified NumericRevisionSettings with which to compare.
Returns:
True, if two NumericRevisionSettings are the same.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.NumericRevisionSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.NumericRevisionSettings.Suffix
The suffix string that will be appended to the number of each revision with Numeric RevisionNumberingType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.NumericRevisionSettings.Prefix
The prefix string that will be prepended to the number of each revision with Numeric RevisionNumberingType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.NumericRevisionSettings.StartNumber
The start number for the sequence.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for number is negative.
Since:
2016

Autodesk.Revit.DB.NumericRevisionSettings.#ctor(System.Int32,System.String,System.String)
Constructs a NumericRevisionSettings object.
Remarks:
The starting number parameter accepts any non-negative integer, and
the prefix and suffix strings are allowed to be empty.
startNumber:
The start number for the sequence.
prefix:
The prefix string for each revision number in the sequence.
suffix:
The suffix string for each revision number in the sequence.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for startNumber is negative.
Since:
2016

Autodesk.Revit.DB.NumericRevisionSettings.#ctor
Constructs a NumericRevisionSettings with a simple, default numbering sequence.
Remarks:
Initializes startNumber to 1.
The prefix and suffix strings are set to empty.
Since:
2016

Autodesk.Revit.DB.NumericRevisionSettings.#ctor(Autodesk.Revit.DB.NumericRevisionSettings)
Constructs a new copy of the input NumericRevisionSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
other is not a valid NumericRevisionSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.NumericRevisionSettings
Contains settings that apply to Revisions with the Numeric RevisionNumberType.
Since:
2016